[
  {
    "title": "Старший менеджер по релизам",
    "company": "MongoDB",
    "company_logo": "mongodb-logo.png",
    "company_logo_height": 40,
    "location": "Удаленно",
    "duration": "июнь 2023 – февраль 2025",
    "bullets": [
      "Сотрудничала с командой разработчиков серверных решений для координации регулярных релизов версий MongoDB, включая текущие и устаревшие версии.",
      "Улучшала внутренние инструменты работы с релизами используя Python, что позволило оптимизировать качество выпускаемых версий и повысить эффективность.",
      "Оценивала приоритет и серьезность проблем, обнаруженных как внутри компании, так и службами поддержки, сотрудничала с инженерами для обеспечения быстрого решения проблем и стабильного цикла релизов.",
      "Организовывала совместные сессии с командами DevOps для выявления областей для улучшения и создал цикл обратной связи, который способствовал формированию культуры непрерывного совершенствования, в конечном итоге улучшая взаимодействие в команде и стабильность релизов.",
      "Coordinated with Cloud, Support, and SDET teams to maintain release quality.",
      "Facilitated the release of major product versions in 2023-2024.",
      "Maintained and optimized the release process, enforcing best engineering practices to improve engineering team performance.",
      "Mentored a colleague to enhance Python skills, fostering team growth and technical knowledge.",
      "Partnered with Engineering Directors and Technical Program Managers to ensure smooth and timely releases.",
      "Conducted funnel interviews for new release team members and helped ramp up engineers joining the release team from other teams."
    ]
  },
  {
    "title": "Менеджер по релизам",
    "company": "Evernote",
    "company_logo": "evernote-logo.svg",
    "company_logo_height": 40,
    "location": "Редвуд Сити, Калифорния",
    "duration": "февраль 2018 – февраль 2023",
    "bullets": [
      "Maintained in-depth knowledge of Evernote desktop, mobile, and web app, platform and tools.",
      "Predicted complexities and challenges to proactively work with internal and external stakeholders for mitigation.",
      "Led end-to-end technical program management for complex, cross-functional projects involving web and mobile applications.",
      "Advocated for new tools and processes to improve release stability and automation.",
      "Utilized deep technical domain expertise to drive technical strategy, planning, and execution in partnership with engineering teams.",
      "Introduced and supported Dogfooding, Beta, and General Audience release for different functional features in desktop and mobile applications.",
      "Coordinated timely content delivery to market, ensuring high quality and transparency resulting in 70+ stable releases in 2021-2022.",
      "Set metrics and dashboards to monitor and assess the quality and stability of the new software release to bring SLO to 99.5% from 97% before change.",
      "Reduced the number of release rollbacks by 73% in 2022 by designing a bug prioritization matrix for the post cutover issues.",
      "Aggregated team processes by analyzing bottlenecks and implementing agile methodology resulting  in a 30% reduction in product turnaround time.",
      "Facilitated and maintained strong communication channels among cross-functional teams, ensuring efficient collaboration and timely resolution of issues.",
      "Administered and evaluated product roadmaps to streamline and prioritize QA and technical support backlog tickets resulting in a 40% elimination of backlogged items.",
      "Led Evernote’s desktop app accessibility requirements implementation as a Program Manager.",
      "Managed a team of 10 onshore and offshore QAs in testing 8 software releases, ensuring timely delivery and minimal errors."
    ]
  },
  {
    "title": "Ведущий инженер-программист",
    "company": "EPAM Systems",
    "company_logo": "epam-logo.png",
    "company_logo_height": 40,
    "location": "Сан-Франциско, Калифорния",
    "duration": "январь 2014 – февраль 2018",
    "bullets": [
      "Headed Global Assessment Committee and championed a training program to assist front-end departments in learning accessibility basics and best principles.",
      "Supervised, managed, and supported a team of senior-level software engineers, assuring work meets technical requirements and timely completion of projects for Goldman Sachs and Google.",
      "Continuously monitored project progress and made adjustments as needed to ensure successful completion.",
      "Designed an internal accessibility training program resulting in competence improvement of 70% across front-end departments."
    ]
  },
  {
    "title": "Старший инженер-программист",
    "company": "EPAM Systems",
    "company_logo": "epam-logo.png",
    "company_logo_height": 40,
    "location": "Минск, Беларусь",
    "duration": "март 2011 – февраль 2014",
    "bullets": [
      "Led a team of on-site and off-site developers to implement projects for international clients such as NBC Universal, Sephora, TUI, OVUM, and The Cools.",
      "Represented EPAM management in meetings with client teams.",
      "Became SME on best practices for the web development available. Collaborated with the UX design team to examine the existing projects to identify errors in markup, styles, and color schema."
    ]
  },
  {
    "title": "Front-end Developer/Content Manager",
    "company": "CIM.by",
    "company_logo": "icons8-company.png",
    "company_logo_height": 40,
    "location": "Минск, Беларусь",
    "duration": "июль 2009 – март 2011",
    "bullets": [
      "Создавал сайты с нуля, используя HTML/CSS и Javascript.",
      "Поддерживала систему управления контентом (CMS) на базе PHP.",
      "Отвечала за добавление и обновление контента и продуктов на сайты электронной коммерции.",
      "Подготавливала рекламные статьи и информационные оповещения.",
      "Улучшала SEO-оптимизацию и структуру сайтов с помощью команды разработчиков."
    ]
  }
]
