[
  {
    "title": "Старший менеджер по релизам",
    "company": "MongoDB",
    "company_logo": "mongodb-logo.png",
    "company_logo_height": 40,
    "location": "Удаленно",
    "duration": "июнь 2023 – февраль 2025",
    "bullets": [
      "Сотрудничала с командой разработчиков серверных решений для координации регулярных релизов версий MongoDB, включая текущие и устаревшие версии.",
      "Улучшала внутренние инструменты работы с релизами используя Python, что позволило оптимизировать качество выпускаемых версий и повысить эффективность.",
      "Оценивала приоритет и серьезность проблем, обнаруженных как внутри компании, так и службами поддержки, сотрудничала с инженерами для обеспечения быстрого решения проблем и стабильного цикла релизов.",
      "Организовывала совместные сессии с командами DevOps для выявления областей для улучшения и создала цикл обратной связи, который способствовал формированию культуры непрерывного совершенствования, в итоге улучшив взаимодействие в команде и стабильность релизов.",
      "Координировала работу с командами облачных вычислений, поддержки и SDET для улучшения качества релизов.",
      "Участвовала в выпуске основных версий продукта в 2023–2024 годах.",
      "Поддерживала и оптимизировала процесс релиза, внедряла передовые методы проектирования для повышения производительности работы команды инженеров.",
      "Была наставником коллеги, помогая улучшить навыков работы с Python, способствуя росту команды и расширению технических знаний.",
      "Сотрудничала с техническими директорами и менеджерами программ для обеспечения бесперебойных и своевременных релизов.",
      "Проводила собеседования с новыми членами команды по релизам и помогала обучать инженеров из других команд, которые хотели присоединиться к команде по управлению релизами."
    ]
  },
  {
    "title": "Менеджер по релизам",
    "company": "Evernote",
    "company_logo": "evernote-logo.svg",
    "company_logo_height": 40,
    "location": "Редвуд Сити, Калифорния",
    "duration": "февраль 2018 – февраль 2023",
    "bullets": [
      "Поддерживала актуальную базу знаний о компьютерных, мобильных и веб-приложениях Evernote, а также платформе и инструментах.",
      "Прогнозировала риски и проблемы, проактивно сотрудничала с разными командами с целью смягчения возможных последствий.",
      "Руководила комплексным управлением техническими программами для сложных кросс-функциональных проектов, включающих веб- и мобильные приложения.",
      "Выступала за внедрение новых инструментов и процессов для повышения стабильности и автоматизации релизов.",
      "Использовала глубокие технические знания для разработки технической стратегии, ее планирования и реализации в партнерстве с инженерными группами.",
      "Внедряла и поддерживала ранеее тестирование (dogfooding), бета-версии и версии для широкой аудитории с различными функциональнами возможностям для компьтерных и мобильных приложений.",
      "Координировала своевременное обновление контента, гарантирующее высокое качество и предсказуемость, что привело к выпуску более 70 стабильных релизов в 2021–2022 годах.",
      "Определяла показатели и цели для мониторинга и оценки качества, а также стабильности новой версии программного обеспечения, что позволило довести SLO с 97% до 99,5%.",
      "В 2022 году количество откатов релизов сократилось на 73% за счет разработки матрицы приоритетности ошибок для проблем, возникающих после перехода на новую версию.",
      "Оптимизировала командные процессы путем анализа узких мест и внедрения Agile методологии, что привело к сокращению времени разработки новых фич на 30%.",
      "Обеспечивала и поддерживала надежные каналы коммуникации между кросс-функциональными командами, обеспечивая эффективное сотрудничество и своевременное решение проблем.",
      "Администрировала и оценивала дорожные карты продуктов для оптимизации и расстановки приоритетов в невыполненных задачах, которые были озвученны командой по контролю качества и технической поддержке, что привело к уменьшению количества невыполненных задач на 40%.",
      "Руководила реализацией требований доступности (accessibility) компьютерного приложения Evernote в качестве менеджера программы.",
      "Управляла командой из 10 специалистов по контролю качества при тестировании 8 версий программного обеспечения, обеспечивая своевременные релизы и минимальное количество ошибок."
    ]
  },
  {
    "title": "Ведущий инженер-программист",
    "company": "EPAM Systems",
    "company_logo": "epam-logo.png",
    "company_logo_height": 40,
    "location": "Сан-Франциско, Калифорния",
    "duration": "январь 2014 – февраль 2018",
    "bullets": [
      "Возглавляла Глобальный комитет по оценке и инициировала программу обучения, призванную помочь фронт-энд командам в изучении основ и принципов обеспечения доступности (accessibility).",
      "Руководила и поддерживала команды ведущих инженеров-программистов, обеспечивая соответствие результатов работы техническим требованиям, а также своевременное завершение проектов для Goldman Sachs и Google.",
      "Отслеживала ход реализации проектов и вносила необходимые коррективы для обеспечения их успешного завершения.",
      "Разработала внутреннюю программу обучения по доступности (accessibility), в результате чего компетенция в этой области сотрудников фронт-энд команд повысилась на 70%."
    ]
  },
  {
    "title": "Старший инженер-программист",
    "company": "EPAM Systems",
    "company_logo": "epam-logo.png",
    "company_logo_height": 40,
    "location": "Минск, Беларусь",
    "duration": "март 2011 – февраль 2014",
    "bullets": [
      "Управляла командой разработчиков, работавших как внутри компании, так и в других странах, и реализовывали проекты для международных клиентов, таких как NBC Universal, Sephora, TUI, OVUM и TheCools.",
      "Представляла EPAM на встречах с командами клиентов.",
      "Стала экспертом по лучшим практикам веб-разработки. Сотрудничала с командой UX-дизайнеров, чтобы изучить существующие проекты и выявить ошибки в разметке, стилях и цветовой схеме."
    ]
  },
  {
    "title": "Front-end Developer/Content Manager",
    "company": "CIM.by",
    "company_logo": "icons8-company.png",
    "company_logo_height": 40,
    "location": "Минск, Беларусь",
    "duration": "июль 2009 – март 2011",
    "bullets": [
      "Создавал сайты с нуля, используя HTML/CSS и Javascript.",
      "Поддерживала систему управления контентом (CMS) на базе PHP.",
      "Отвечала за добавление и обновление контента и продуктов на сайты электронной коммерции.",
      "Подготавливала рекламные статьи и информационные оповещения.",
      "Улучшала SEO-оптимизацию и структуру сайтов с помощью команды разработчиков."
    ]
  }
]
