[
  {
    "title": "Старэйшы менеджар па выпуску праграм",
    "company": "MongoDB",
    "company_logo": "mongodb-logo.png",
    "company_logo_height": 40,
    "location": "Дыстанцыйна",
    "duration": "чэрвень 2023 – люты 2025",
    "bullets": [
      "Супрацоўнічала з камандамі інжынераў як кіроўца рэгулярных рэлізаў версій MongoDB, што ўключала бягучыя і састарэлыя версіі.",
      "Займалася паляпшэннем існуючых інструментаў выпуску праграмнага забеспячэння з выкарыстаннем Python, аптымізавала якасць рэлізаў і павышала эфектыўнасць.",
      "Ацэньвала прыярытэт і сур'ёзнасць праблем, выяўленых унутры інжынерных каманд або дапаведзеных камандамі падтрымкі, каардынавала зусілля з інжынерамі для забеспячэння хуткага вырашэння праблем і стабільнага цыклу рэлізаў.",
      "Арганізавала сумесныя сесіі з камандамі DevOps для вызначэння абласцей, якія магчыма палепшыць, і стварыла цыкл зваротнай сувязі, які ўсталёўваў культуру пастаяннага ўдасканалення, што ў выніку спрыяла супрацоўніцтву камандаў і стабільнасці рэлізаў.",
      "Працавала разам з камандамі распрацоўкі воблачных сістэм, камандай падтрымкі і SDET для падтрымкі якасці рэлізаў",
      "Удзельнічала ў выпуску асноўных версій прадукта ў 2023-2024 гадах.",
      "Падтрымлівала і аптымізавала працэс выпуску праграмнага забеспячэння, укараняла перадавыя інжынерныя практыкі, якія падвышвалі прадукцыйнасць каманды інжынераў.",
      "Дапамагала калезе ў вывучэнні Python, што спрыяла росту каманды і развіццю тэхнічных ведаў.",
      "Супрацоўнічала з дырэктарамі камандаў інжынераў і кіраўнікамі тэхнічных праграм для забеспячэння якасных і своечасовых рэлізаў.",
      "Праводзіла інтэрв'ю з новымі членамі каманды і дапамагала інжынерам з іншых каманд далучацца да каманды па рэлізах."
    ]
  },
  {
    "title": "Менеджар па выпуску праграм",
    "company": "Evernote",
    "company_logo": "evernote-logo.svg",
    "company_logo_height": 40,
    "location": "Рэдвуд Сіці, Каліфорнія",
    "duration": "люты 2018 – люты 2023",
    "bullets": [
      "Падтрымлівала базу ведаў пра кампутарных, мабільных і вэб праграмах, а таксама платформах і інструментах Evernote.",
      "Прагназавала магчымыя складанасці і праблемы, праактыўна супрацоўнічала з рознымі камандамі каб прадухіліць негатыўныя наступствы.",
      "Займалася комплексным тэхнічным кіраваннем праграмамі для складаных, міжфункцыянальных праектаў, якія ўключаюць вэб- і мабільныя прыкладанні.",
      "Прапаноўвала новыя інструменты і працэсы для паляпшэння стабільнасці і аўтаматызацыі рэлізаў.",
      "Выкарыстоўвала свае глыбокія веды ў тэхнічнай галіне для распрацоўкі тэхнічнай стратэгіі, а таксама яе планавання і выканання ў партнёрстве з камандамі інжынераў.",
      "Запрапанавала і падтрымлівала ранняе тэставанне (dogfooding), заправаджвала бэта-версіі і версіі для шырокай аўдыторыі, якія падтрымлівалі розныя функцыі у кампутарных і мабільных прыкладаннях.",
      "Каардынавала своечасовыя рэлізы, забяспечвала высокую якасць і празрыстыя вынікі для больш як за 70 стабільных рэлізаў у 2021-2022 гадах.",
      "Вызначала паказчыкі для маніторынгу і ацэнкі якасці і стабільнасці новых рэлізаў праграмнага забеспячэння, каб павысіць SLO да 99,5% (97% да змяненняў).",
      "Скараціла колькасць адкатаў рэлізаў у 2022 годзе на 73%, пасля таго, як распрацавала матрыцу прыярытэтызацыі багаў пасля пераходу на новую версію прыкладання.",
      "Аб'яднала працэсы для камандаў шляхам аналізу вузкіх месцаў і ўсталявання метадалогіі Agile, што прывяло да скарачэння часу разробкі і тэставання асобных фіч на 30%.",
      "Спрыяла наладжванню і падтрыманню надзейных каналаў сувязі паміж камандамі, забяспечвала эфектыўнае супрацоўніцтва і своечасовае вырашэнне праблем.",
      "Адміністравала і ацэньвала дарожныя карты прадуктаў для аптымізацыі і прыярытэтызацыі запытаў ад каманды кантролю якасці і тэхнічнай падтрымкі, што прывяло да ліквідацыі 40% састарэлых запытаў.",
      "Кіравала рэалізацыяй патрабаванняў для падтрымкі людзей, якія маюць абмежаванні пры звычным карыстанні кампутарных праграм (accessibility support).",
      "Кіравала камандай з 10 экспертаў па якасці падчас тэсціравання 8 выпускаў праграмнага забеспячэння."
    ]
  },
  {
    "title": "Вядучы інжынер-праграміст",
    "company": "EPAM Systems",
    "company_logo": "epam-logo.png",
    "company_logo_height": 40,
    "location": "Сан-Францыска, Каліфорнія",
    "duration": "люты 2014 – люты 2018",
    "bullets": [
      "Узначальвала Глабальны ацэначны камітэт і займалася за распрацоўкай праграмы навучання, каб дапамагчы розным фронтэнд камандам вывучыць асновы accessibility, а таксама галоўныя яе прынцыпы.",
      "Кіравала і падтрымлівала каманду інжынераў старэйшага ўзроўню, забяспечваючы адпаведнасць выканнання задач тэхнічным патрабаванням і своечасовае завяршэнне праектаў для Goldman Sachs і Google.",
      "Сачыла за ходам праектаў і ўносіла неабходныя карэктывы для забеспячэння іх паспяховага завяршэння.",
      "Распрацавала ўнутраную праграму навучання па даступнасці (accessibility), у выніку якой кампетэнцыя ва ўсіх фронтэнд камандах павысілася на 70%."
    ]
  },
  {
    "title": "Старэйшы інжынер-праграміст",
    "company": "EPAM Systems",
    "company_logo": "epam-logo.png",
    "company_logo_height": 40,
    "location": "Мінск, Беларусь",
    "duration": "сакавік 2011 – люты 2014",
    "bullets": [
      "Кіравала камандай распрацоўшчыкаў, якія размяшчаліся як на баку заказчыка, так і на тэрыторыі іншых краін, і рэалізоўвалі праекты для міжнародных кліентаў, такіх як NBC Universal, Sephora, TUI, OVUM і TheCools.",
      "Прадстаўляла EPAM на сустрэчах з камандамі кліентаў.",
      "Стала экспертам у вэб-распрацоўцы. Супрацоўнічала з камандай UX-дызайнераў для вывучэння існуючых праектаў на прадмет памылак у разметцы, стылях і каляровай схеме."
    ]
  },
  {
    "title": "Распрацоўшчык фронтэнда",
    "company": "CIM.by",
    "company_logo": "icons8-company.png",
    "company_logo_height": 40,
    "location": "Мінск, Беларусь",
    "duration": "ліпень 2009 – сакавік 2011",
    "bullets": [
      "Стварала сайты з нуля з выкарыстаннем HTML/CSS і Javascript.",
      "Падтрымлівала сістэму кіравання кантэнтам (CMS) на базе PHP.",
      "Адпавядала за даданне і абнаўленне кантэнта і прадуктаў на сайтах электроннай камерцыі.",
      "Падрыхтоўвала рэкламныя артыкулы і інфармацыйныя паведамленні.",
      "Паляпшала SEO-аптымізацыю і структуру сайтаў з дапамогай каманды распрацоўшчыкаў."
    ]
  }
]
